# SUCHEN UND ERSETZEN

Führe die Übung in Python mit der Datei ```/vol/lehre/msmoabs2024/fileformats/studierende.txt``` durch.\
Importiere sie als Pandas Dataframe und löse die folgenden Aufgaben:

## Import

In [2]:
import pandas as pd

In [3]:
student_table = pd.read_csv("/vol/lehre/msmoabs2024/fileformats/studierende.txt", sep="\t")
student_table

       Name Studiengang  Semester
0   Michael         Bio         1
1      Lisa        Chem         1
2   Patrick        Chem         3
3       Mai         Bio         3
4     Mateo        Chem         5
5     Lucas         Bio         5
6     Tabea         Bio         5
7    Jamila        Chem         5
8     Marek        Chem         3
9    Jochen         Bio         2
10   Miriam        Chem         2
11  Babette         Bio         4

#### 1. Gib die erste Spalte aus.

In [4]:
student_table.iloc[:,0]

0     Michael
1        Lisa
2     Patrick
3         Mai
4       Mateo
5       Lucas
6       Tabea
7      Jamila
8       Marek
9      Jochen
10     Miriam
11    Babette
Name: Name, dtype: object

In [5]:
student_table[["Name"]]

       Name
0   Michael
1      Lisa
2   Patrick
3       Mai
4     Mateo
5     Lucas
6     Tabea
7    Jamila
8     Marek
9    Jochen
10   Miriam
11  Babette

#### 2. Gib die erste Spalte ohne die erste Zeile aus.

In [6]:
student_table.iloc[1:,0]

1        Lisa
2     Patrick
3         Mai
4       Mateo
5       Lucas
6       Tabea
7      Jamila
8       Marek
9      Jochen
10     Miriam
11    Babette
Name: Name, dtype: object

#### 3. Gib die 2. Zeile der Tabelle aus.

In [7]:
student_table.iloc[[2]]

      Name Studiengang  Semester
2  Patrick        Chem         3

In [8]:
student_table.iloc[2]

Name           Patrick
Studiengang       Chem
Semester             3
Name: 2, dtype: object

#### 4. Gib die Zeilen 2 bis 5 aus.

In [9]:
student_table.iloc[2:6]

      Name Studiengang  Semester
2  Patrick        Chem         3
3      Mai         Bio         3
4    Mateo        Chem         5
5    Lucas         Bio         5

#### 5. Gib die Daten aller Studierenden aus, deren Name mit einem M beginnt.

In [10]:
student_table.loc[student_table["Name"].str.startswith('M', na=False)]

       Name Studiengang  Semester
0   Michael         Bio         1
3       Mai         Bio         3
4     Mateo        Chem         5
8     Marek        Chem         3
10   Miriam        Chem         2

#### 6. Gib alle Namen der Studierenden an, die folgende Buchstaben in ihren Namen enthalten: i und/oder c.

In [8]:
student_table.loc[student_table["Name"].str.contains("[ic]", regex=True)]["Name"]

0     Michael
1        Lisa
2     Patrick
3         Mai
5       Lucas
7      Jamila
9      Jochen
10     Miriam
Name: Name, dtype: object

In [9]:
student_table.loc[student_table["Name"].str.contains("i|c")]["Name"]

0     Michael
1        Lisa
2     Patrick
3         Mai
5       Lucas
7      Jamila
9      Jochen
10     Miriam
Name: Name, dtype: object

**Das Ganze für den Fall, dass sowohl i als auch c enthalten sein sollen:**

In [4]:
student_table.loc[student_table["Name"].str.contains('(?=.*i)(?=.*c).*', regex=True)]["Name"]

0    Michael
2    Patrick
Name: Name, dtype: object

In [13]:
student_table[(student_table['Name'].str.contains('c')) & (student_table['Name'].str.contains('i'))]["Name"]

0    Michael
2    Patrick
Name: Name, dtype: object

#### 7. Gib die Studierendendaten aller Studierenden aus, die mehr als 2 Semester studieren.

In [14]:
student_table[student_table["Semester"] > 2]

       Name Studiengang  Semester
2   Patrick        Chem         3
3       Mai         Bio         3
4     Mateo        Chem         5
5     Lucas         Bio         5
6     Tabea         Bio         5
7    Jamila        Chem         5
8     Marek        Chem         3
11  Babette         Bio         4

In [15]:
student_table[student_table.Semester > 2]

       Name Studiengang  Semester
2   Patrick        Chem         3
3       Mai         Bio         3
4     Mateo        Chem         5
5     Lucas         Bio         5
6     Tabea         Bio         5
7    Jamila        Chem         5
8     Marek        Chem         3
11  Babette         Bio         4

#### 8. Gib die Namen aller Studierenden aus, die mehr als 2 Semester studieren

In [16]:
student_table[student_table["Semester"] > 2]["Name"]

2     Patrick
3         Mai
4       Mateo
5       Lucas
6       Tabea
7      Jamila
8       Marek
11    Babette
Name: Name, dtype: object

In [17]:
student_table[student_table.Semester > 2].Name

2     Patrick
3         Mai
4       Mateo
5       Lucas
6       Tabea
7      Jamila
8       Marek
11    Babette
Name: Name, dtype: object

#### 9. Gib die Studierendendaten aller Biologie-Studierenden aus.

In [18]:
student_table[student_table["Studiengang"] == "Bio"]

       Name Studiengang  Semester
0   Michael         Bio         1
3       Mai         Bio         3
5     Lucas         Bio         5
6     Tabea         Bio         5
9    Jochen         Bio         2
11  Babette         Bio         4

In [19]:
student_table[student_table.Studiengang == "Bio"]

       Name Studiengang  Semester
0   Michael         Bio         1
3       Mai         Bio         3
5     Lucas         Bio         5
6     Tabea         Bio         5
9    Jochen         Bio         2
11  Babette         Bio         4

#### 10. Gib die Namen aller Biologie-Studierenden aus, die mehr als 2 Semester studiert haben.

In [20]:
student_table[(student_table["Semester"] > 2) & (student_table["Studiengang"] == "Bio")]["Name"]

3         Mai
5       Lucas
6       Tabea
11    Babette
Name: Name, dtype: object

In [21]:
student_table[(student_table.Semester > 2) & (student_table.Studiengang == "Bio")].Name

3         Mai
5       Lucas
6       Tabea
11    Babette
Name: Name, dtype: object

#### 11. Gib die Namen aller Chemie-Studierenden aus, die im 2.Semester sind

In [22]:
student_table[(student_table["Semester"] == 2) & (student_table["Studiengang"] == "Chem")]["Name"]

10    Miriam
Name: Name, dtype: object

In [23]:
student_table[(student_table.Semester == 2) & (student_table.Studiengang == "Chem")]["Name"]

10    Miriam
Name: Name, dtype: object

#### 12. Ändere das Semester aller Studierenden auf 2

In [24]:
student_table["Semester"] = 2
student_table

       Name Studiengang  Semester
0   Michael         Bio         2
1      Lisa        Chem         2
2   Patrick        Chem         2
3       Mai         Bio         2
4     Mateo        Chem         2
5     Lucas         Bio         2
6     Tabea         Bio         2
7    Jamila        Chem         2
8     Marek        Chem         2
9    Jochen         Bio         2
10   Miriam        Chem         2
11  Babette         Bio         2

#### 13. Ersetzte den Namen Mateo durch das Wort "Unbekannt"

In [25]:
student_table = student_table.replace("Mateo", "Unbekannt")
student_table

         Name Studiengang  Semester
0     Michael         Bio         2
1        Lisa        Chem         2
2     Patrick        Chem         2
3         Mai         Bio         2
4   Unbekannt        Chem         2
5       Lucas         Bio         2
6       Tabea         Bio         2
7      Jamila        Chem         2
8       Marek        Chem         2
9      Jochen         Bio         2
10     Miriam        Chem         2
11    Babette         Bio         2

#### 14. Lösche alle Zeilen deren Studierendennamen mit einem M beginnen aus dem DataFrame und zeige ihn dann an.

In [26]:
student_table = student_table.drop(student_table[student_table["Name"].str.startswith("M")].index, axis=0)
student_table

         Name Studiengang  Semester
1        Lisa        Chem         2
2     Patrick        Chem         2
4   Unbekannt        Chem         2
5       Lucas         Bio         2
6       Tabea         Bio         2
7      Jamila        Chem         2
9      Jochen         Bio         2
11    Babette         Bio         2